Repository: davidacm/SpeechHistoryExplorer
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fi

source: Speech History Explorer
fi: Puhehistorian selain

source: Copy the currently selected speech history Explorer item to the clipboard, which by default will be the most recently spoken text by NVDA.
fi: Kopioi leikepöydälle valittuna oleva puhehistorian kohde, joka on oletusarvoisesti viimeisin NVDA:n puhuma teksti.

source: Review the previous item in NVDA's speech history.
fi: Tarkastele NVDA:n puhehistorian edellistä kohdetta.

source: Review the next item in NVDA's speech history.
fi: Tarkastele NVDA:n puhehistorian seuraavaa kohdetta.

source: Opens a dialog showing all most recent items spoken by NVDA
fi: Avaa valintaikkunan, joka näyttää kaikki viimeisimmät NVDA:n puhumat kohteet

source: &Maximum number of history entries (requires NVDA restart to take effect)
fi: &Historiakohteiden enimmäismäärä (edellyttää NVDA:n uudelleenkäynnistystä)

source: Trim whitespace from &start when copying text
fi: Poista kopioitaessa tyhjämerkit tekstin a&lusta

source: Trim whitespace from &end when copying text
fi: Poista kopioitaessa tyhjämerkit tekstin l&opusta

source: Beep when performing actions
fi: Piippaa toimintoja suoritettaessa

source: Beep left or right when no more older or newer elements are available
fi: Piiippaa vasemmalla tai oikealla, kun vanhempia tai uudempia kohteita ei ole enempää saatavilla

source: Speech history items
fi: Puhehistorian kohteet

source: &Search
fi: &Hae

source: History list
fi: Historialuettelo

source: &Copy item
fi: &Kopioi kohde

source: Copy &all
fi: Kopioi k&aikki

source: C&lean history
fi: T&yhjennä historia

source: &Refresh history
fi: &Päivitä historia

source: C&lose
fi: S&ulje
